; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-8)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	)
(:init
	(at plane1 city6)
	(= (capacity plane1) 5323)
	(= (fuel plane1) 1103)
	(= (slow-burn plane1) 2)
	(= (fast-burn plane1) 7)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 6)
	(at person1 city1)
	(at person2 city6)
	(at person3 city3)
	(at person4 city2)
	(at person5 city0)
	(at person6 city3)
	(at person7 city2)
	(at person8 city7)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 912)
	(= (distance city0 city2) 947)
	(= (distance city0 city3) 602)
	(= (distance city0 city4) 511)
	(= (distance city0 city5) 688)
	(= (distance city0 city6) 677)
	(= (distance city0 city7) 971)
	(= (distance city1 city0) 912)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 669)
	(= (distance city1 city3) 664)
	(= (distance city1 city4) 974)
	(= (distance city1 city5) 706)
	(= (distance city1 city6) 787)
	(= (distance city1 city7) 912)
	(= (distance city2 city0) 947)
	(= (distance city2 city1) 669)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 697)
	(= (distance city2 city4) 782)
	(= (distance city2 city5) 529)
	(= (distance city2 city6) 995)
	(= (distance city2 city7) 936)
	(= (distance city3 city0) 602)
	(= (distance city3 city1) 664)
	(= (distance city3 city2) 697)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 765)
	(= (distance city3 city5) 527)
	(= (distance city3 city6) 922)
	(= (distance city3 city7) 870)
	(= (distance city4 city0) 511)
	(= (distance city4 city1) 974)
	(= (distance city4 city2) 782)
	(= (distance city4 city3) 765)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 735)
	(= (distance city4 city6) 688)
	(= (distance city4 city7) 861)
	(= (distance city5 city0) 688)
	(= (distance city5 city1) 706)
	(= (distance city5 city2) 529)
	(= (distance city5 city3) 527)
	(= (distance city5 city4) 735)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 727)
	(= (distance city5 city7) 889)
	(= (distance city6 city0) 677)
	(= (distance city6 city1) 787)
	(= (distance city6 city2) 995)
	(= (distance city6 city3) 922)
	(= (distance city6 city4) 688)
	(= (distance city6 city5) 727)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 804)
	(= (distance city7 city0) 971)
	(= (distance city7 city1) 912)
	(= (distance city7 city2) 936)
	(= (distance city7 city3) 870)
	(= (distance city7 city4) 861)
	(= (distance city7 city5) 889)
	(= (distance city7 city6) 804)
	(= (distance city7 city7) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city4)
	(at person2 city2)
	(at person3 city3)
	(at person4 city7)
	(at person5 city5)
	(at person6 city3)
	(at person7 city7)
	(at person8 city2)
	))

(:metric minimize (+ (* 5 (total-time))  (* 3 (total-fuel-used))))
)

; plan
1. (board person2 plane1 city6)
   deleted: (at person2 city6)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 8
2. (refuel plane1 city6)
   changed: (fuel plane1) from 1103 to 5323
   goals met: 2 of 8
3. (fly plane1 city6 city2)
   deleted: (at plane1 city6)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 0 to 1990, (fuel plane1) from 5323 to 3333
   goals met: 2 of 8
4. (debark person2 plane1 city2)
   deleted: (in person2 plane1)
   added: (at person2 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 3 of 8
5. (board person4 plane1 city2)
   deleted: (at person4 city2)
   added: (in person4 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 8
6. (board person7 plane1 city2)
   deleted: (at person7 city2)
   added: (in person7 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 3 of 8
7. (fly plane1 city2 city1)
   deleted: (at plane1 city2)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 1990 to 3328, (fuel plane1) from 3333 to 1995
   goals met: 3 of 8
8. (board person1 plane1 city1)
   deleted: (at person1 city1)
   added: (in person1 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 3 of 8
9. (fly plane1 city1 city4)
   deleted: (at plane1 city1)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 3328 to 5276, (fuel plane1) from 1995 to 47
   goals met: 3 of 8
10. (debark person1 plane1 city4)
   deleted: (in person1 plane1)
   added: (at person1 city4)
   changed: (onboard plane1) from 3 to 2
   goals met: 4 of 8
11. (refuel plane1 city4)
   changed: (fuel plane1) from 47 to 5323
   goals met: 4 of 8
12. (fly plane1 city4 city7)
   deleted: (at plane1 city4)
   added: (at plane1 city7)
   changed: (total-fuel-used) from 5276 to 6998, (fuel plane1) from 5323 to 3601
   goals met: 4 of 8
13. (debark person4 plane1 city7)
   deleted: (in person4 plane1)
   added: (at person4 city7)
   changed: (onboard plane1) from 2 to 1
   goals met: 5 of 8
14. (debark person7 plane1 city7)
   deleted: (in person7 plane1)
   added: (at person7 city7)
   changed: (onboard plane1) from 1 to 0
   goals met: 6 of 8
15. (board person8 plane1 city7)
   deleted: (at person8 city7)
   added: (in person8 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 6 of 8
16. (fly plane1 city7 city2)
   deleted: (at plane1 city7)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 6998 to 8870, (fuel plane1) from 3601 to 1729
   goals met: 6 of 8
17. (debark person8 plane1 city2)
   deleted: (in person8 plane1)
   added: (at person8 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 7 of 8
18. (fly plane1 city2 city5)
   deleted: (at plane1 city2)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 8870 to 9928, (fuel plane1) from 1729 to 671
   goals met: 7 of 8
19. (refuel plane1 city5)
   changed: (fuel plane1) from 671 to 5323
   goals met: 7 of 8
20. (fly plane1 city5 city0)
   deleted: (at plane1 city5)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 9928 to 11304, (fuel plane1) from 5323 to 3947
   goals met: 7 of 8
21. (board person5 plane1 city0)
   deleted: (at person5 city0)
   added: (in person5 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 7 of 8
22. (fly plane1 city0 city5)
   deleted: (at plane1 city0)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 11304 to 12680, (fuel plane1) from 3947 to 2571
   goals met: 7 of 8
23. (debark person5 plane1 city5)
   deleted: (in person5 plane1)
   added: (at person5 city5)
   changed: (onboard plane1) from 1 to 0
   goals met: 8 of 8
